{
  "backend/main.mo": "Defines user-specific finance data structures and maps, category and transaction comparators, and profile/category/transaction/receipt storage with access control and mixins.",
  "feature_evidence.json": "Lists implemented features with associated files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Provides high-level summaries for all frontend source files for reference or documentation.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light/dark mode palettes, and base styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures authentication gating, profile setup, theme provider, and routing for main pages.",
  "frontend/src/components/analytics/CashflowInsightsCard.tsx": "UI card displaying cashflow insights, trends, and largest expense category using formatted data.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Screen shown to unauthenticated users with lock icon, message, and login button.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity and clears queries on logout with status-based UI states.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Displays a dialog for entering and saving the user's name with validation and mutation handling.",
  "frontend/src/components/calendar/DayTransactionsModal.tsx": "Shows a modal listing all transactions for a specific day, grouped with category names and formatted amounts.",
  "frontend/src/components/categories/CategoryFormDialog.tsx": "Dialog for creating or editing a category with fields for name, type, color, and icon, saving via mutations.",
  "frontend/src/components/charts/CashflowTrendLineChart.tsx": "Renders a 6‑month cashflow line chart computed from transactions.",
  "frontend/src/components/charts/ExpenseCategoryPieChart.tsx": "Generates a pie chart of current‑month expenses grouped by category, with fallback when no data exists.",
  "frontend/src/components/charts/IncomeExpenseBarChart.tsx": "Displays a 6‑month bar chart comparing income and expenses.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with sidebar, header, and routed content outlet.",
  "frontend/src/components/layout/Header.tsx": "Header bar showing sidebar toggle, theme switch, user greeting, and login button.",
  "frontend/src/components/layout/SidebarNav.tsx": "Sidebar navigation with menu links, active state handling, app branding, and a footer with attribution.",
  "frontend/src/components/receipts/ReceiptPicker.tsx": "Handles image selection, validation, preview, upload, and removal for transaction receipts.",
  "frontend/src/components/receipts/ReceiptPreviewModal.tsx": "Displays a full-size receipt image inside a dialog modal.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Toggles between light and dark themes using next-themes.",
  "frontend/src/components/transactions/ReceiptThumbnail.tsx": "Fetches and displays a small clickable receipt thumbnail with a modal preview.",
  "frontend/src/components/transactions/TransactionFormDialog.tsx": "Form dialog for creating or editing transactions, including category selection and optional receipt upload.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, logout, and identity restoration.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating categories, transactions, receipts, and user profiles.",
  "frontend/src/i18n/id.ts": "Indonesian translation strings for navigation, transactions, categories, calendar, validation, and toasts.",
  "frontend/src/index.css": "Configures Tailwind layers and defines extensive CSS variables for light and dark themes along with base global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/CalendarPage.tsx": "Renders a monthly transaction calendar with daily income/expense summaries and a modal for viewing transactions per day.",
  "frontend/src/pages/CategoriesPage.tsx": "Displays and manages income and expense categories with add, edit, and delete functionality via dialogs.",
  "frontend/src/pages/DashboardPage.tsx": "Shows a financial dashboard including monthly totals, alerts, charts, and a dialog for adding transactions.",
  "frontend/src/pages/TransactionsPage.tsx": "Provides a searchable, filterable, sortable list of transactions with add, edit, and delete options.",
  "frontend/src/utils/currency.ts": "Contains helper functions for formatting and parsing Indonesian currency values.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL query/hash parameters and storing, retrieving, or clearing them in sessionStorage, including a persisted getter that favors URL values.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radius, shadows, animations, typography, container queries, and Inter font, extending a themed design system.",
  "project_state.json": "Stores the project’s state, version, feature list, architecture notes, and summary for a personal finance web app."
}